# AnalyticalElementsInvalidAfterUpgrade Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalElementsInvalidAfterUpgrade Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
One or several analytical elements have become invalid during the upgrade process and will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalElementsInvalidAfterUpgrade { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalElementsInvalidAfterUpgrade As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalElementsInvalidAfterUpgrade {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace